tuts/1DNHPTNH3Simulations-c559d467edef6f5c10644fb41f1c4c7d9278721e/CASES/2.FormalSimulations/1D_NH3_NHPT_ConstP/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 6096000;

boundaryField
{
    left
    {
        type            zeroGradient;
    }
    right
    {
        type            zeroGradient;
    }
    top
    {
        //type            zeroGradient;
        type            waveTransmissive;
        value           uniform 6096000;  //important for correct I/O
        field           p;                //the name of the field that we are working on
        gamma           1.4;              //the ratio of specific heats
        rho             rho;              //the name of the density field
        psi             thermo:psi;       //the name of the field that is the deriv. of density with respect to pressure
        lInf            1;                //a measure of how far away the far-field condition should be
        fieldInf        6096000;          //the far-field value to be applied to p
    }
    bottom
    {
        //type            zeroGradient;
        type            waveTransmissive;
        value           uniform 6096000;  //important for correct I/O
        field           p;                //the name of the field that we are working on
        gamma           1.4;              //the ratio of specific heats
        rho             rho;              //the name of the density field
        psi             thermo:psi;       //the name of the field that is the deriv. of density with respect to pressure
        lInf            1;                //a measure of how far away the far-field condition should be
        fieldInf        6096000;          //the far-field value to be applied to p
    }
    empty
    {
        type            empty;
    }
}


// ************************************************************************* //
